In [2]:
import MySQLdb
from selenium import webdriver

In [3]:
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")

In [12]:
my_head = "SYSTEM PROGRAMMING"
#query = "SELECT course_name FROM course where course_name LIKE '{}%';".format(my_head)
query = "SELECT * FROM course"
cursor = conn.cursor()
cursor.execute(query)

results = cursor.fetchall()
for i in range(len(results[0])):
    print(results[0][i])
    
conn.close()

1000
SYSTEM PROGRAMMING
Department of Information Engineering and Computer Science
3

In [23]:
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")

query = "SELECT coursename FROM course where courseID LIKE 1000;"
cursor = conn.cursor()
cursor.execute(query)
results = cursor.fetchall()
for i in range(len(results[0])):
    print(results[0][i])
    
conn.close()

SYSTEM PROGRAMMING

In [4]:
#create table
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
cur = conn.cursor()
cur.execute("""CREATE TABLE student(ID int NOT NULL UNIQUE,
                                    name varchar(20) NOT NULL,
                                    department varchar(30),
                                    sex varchar(10),
                                    tot_credits int)""")
conn.close()

In [4]:
#create table(course)
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
cur = conn.cursor()
cur.execute("""CREATE TABLE course(courseID int NOT NULL UNIQUE,
                                   coursename varchar(50) NOT NULL,
                                   department varchar(100),
                                   credits int,
                                   required_or_elective varchar(20),
                                   time varchar(50),
                                   classroomID int)""")
conn.close()

In [19]:
#create table(user)
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
cur = conn.cursor()
cur.execute("""CREATE TABLE aaa(courseID int NOT NULL UNIQUE);""")
#create table users ( id int not null auto_increment, name varchar(20) not null, email varchar(20) not null, password char(80) not null, primary key (id) );
conn.close()

In [5]:
#create table(user)
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
cur = conn.cursor()
newuser_time = "CREATE TABLE " + "bbb" + "_time (time int NOT NULL UNIQUE);"
cur.execute(newuser_time)
conn.close()

In [4]:
#create table(classroom)
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
cur = conn.cursor()
cur.execute("""CREATE TABLE classroom(classroomID int NOT NULL UNIQUE,
                                      capacity int);""")
#create table users ( id int not null auto_increment, name varchar(20) not null, email varchar(20) not null, password char(80) not null, primary key (id) );
conn.close()

In [34]:
#insert data into table
#if you want to insert somthing into table, don't forget conn.commit()
#then you can insert successively

conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
cur = conn.cursor()
cur.execute("""INSERT INTO student(ID, name, department, sex, tot_credits)
               VALUES('0001',
                      'Wendy',
                      'Information Engineering and Computer Science',
                      'female',
                      '0')""")
conn.commit()
conn.close()

In [5]:
#insert data into classroom
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
cur = conn.cursor()
cur.execute("""INSERT INTO classroom(classroomID, capacity)
               VALUES('303', '2')""")
cur.execute("""INSERT INTO classroom(classroomID, capacity)
               VALUES('204', '1')""")
cur.execute("""INSERT INTO classroom(classroomID, capacity)
               VALUES('104', '3')""")
cur.execute("""INSERT INTO classroom(classroomID, capacity)
               VALUES('405', '5')""")
conn.commit()
conn.close()

In [3]:
#insert data into classroom(part2)
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
cur = conn.cursor()
cur.execute("""INSERT INTO classroom(classroomID, capacity)
               VALUES('102', '2')""")
cur.execute("""INSERT INTO classroom(classroomID, capacity)
               VALUES('402', '1')""")
conn.commit()
conn.close()

In [5]:
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
cur = conn.cursor()
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1000',
                      'SYSTEM PROGRAMMING',
                      'Department of Information Engineering and Computer Science',
                      '3',
                      'Required',
                      'Mon-02-03-04',
                      '303')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1001',
                      'DATABASE SYSTEMS',
                      'Department of Information Engineering and Computer Science',
                      '3',
                      'Required',
                      'Thu-06-07-08',
                      '204')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1002',
                      'PROBABILITY AND STATISTICS',
                      'Department of Information Engineering and Computer Science',
                      '3',
                      'Required',
                      'Tue-02-03-04',
                      '104')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1003',
                      'COMBINATIONAL MATHEMATICS',
                      'Department of Information Engineering and Computer Science',
                      '3',
                      'Elective',
                      'Tue-02-03-04',
                      '405')""")
conn.commit()
conn.close()

In [6]:
#insert data(part2)
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
cur = conn.cursor()
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1004',
                      'LINEAR ALGEBRA',
                      'Department of Information Engineering and Computer Science',
                      '3',
                      'Required',
                      'Tue-01-02-03',
                      '303')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1005',
                      'GENERAL PHYSICS - ELECTRIC, MAGNETIC, OPTICS LAB.',
                      'Department of Information Engineering and Computer Science',
                      '1',
                      'Required',
                      'Wed-02-03-04',
                      '405')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1006',
                      'CALCULUS(2)',
                      'Department of Information Engineering and Computer Science',
                      '3',
                      'Required',
                      'Wed-06-07-08',
                      '405')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1007',
                      'UNIX APPLICATIONS AND PRACTICES',
                      'Department of Information Engineering and Computer Science',
                      '2',
                      'Elective',
                      'Thu-09-10',
                      '405')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1008',
                      'ELECTRICAL ENGINEERING',
                      'Department of Mechanical and Computer-Aided Engineering',
                      '3',
                      'Required',
                      'Tue-02-03-04',
                      '204')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1009',
                      'ORGANIC CHEMISTRY(1)',
                      'Department of Fiber and Composite Materials',
                      '3',
                      'Required',
                      'Mon-02-03-04',
                      '405')""")
conn.commit()
conn.close()

In [7]:
#insert data(part3)
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
cur = conn.cursor()
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1010',
                      'E-COMMERCE SECURITY',
                      'Department of Information Engineering and Computer Science',
                      '3',
                      'Elective',
                      'Wed-11-12-13',
                      '405')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1011',
                      'INTRODUCTION TO DIGITAL SIGNAL PROCESSING',
                      'Department of Information Engineering and Computer Science',
                      '3',
                      'Elective',
                      'Mon-08-09-10',
                      '303')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1012',
                      'SYSTEM SECURITY',
                      'Department of Information Engineering and Computer Science',
                      '3',
                      'Elective',
                      'Wed-10-Thu-03-04',
                      '104')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1013',
                      'PROGRAMMING LANGUAGE',
                      'Department of Information Engineering and Computer Science',
                      '3',
                      'Elective',
                      'Mon-02-03-04',
                      '104')""")
conn.commit()
conn.close()

In [4]:
#insert data(part4)
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
cur = conn.cursor()
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1014',
                      'ENGINEERING MATHEMATICS(2)',
                      'Department of Electrical Engineering',
                      '3',
                      'Required',
                      'Tue-01-02-03',
                      '102')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1015',
                      'SIGNALS AND SYSTEMS',
                      'Department of Electrical Engineering',
                      '3',
                      'Required',
                      'Mon-03-04-05',
                      '402')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1016',
                      'ELECTRONICS(2)',
                      'Department of Electrical Engineering',
                      '3',
                      'Required',
                      'Mon-05-06-07',
                      '102')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1017',
                      'PELECTRONICS LAB.(2)',
                      'Department of Electrical Engineering',
                      '3',
                      'Required',
                      'Tue-02-03-04',
                      '102')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1018',
                      'ACCOUNTING(2)',
                      'Department of Accounting',
                      '3',
                      'Required',
                      'Tue-06-07-08',
                      '102')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1019',
                      'COMPANY ACT & NEGOTIABLE INSTRUMENTS ACT',
                      'Department of Accounting',
                      '3',
                      'Elective',
                      'Wed-11-12-13',
                      '102')""")
cur.execute("""INSERT INTO course(courseID, coursename, department, credits, required_or_elective, time, classroomID)
               VALUES('1020',
                      'INVESTMENTS',
                      'Department of Accounting',
                      '3',
                      'Elective',
                      'Fri-02-03-04',
                      '402')""")
conn.commit()
conn.close()

In [11]:
#delete table
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
cur = conn.cursor()
cur.execute("DROP TABLE zzz")
conn.close()

In [23]:
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
query = "SELECT required_or_elective FROM COURSE WHERE courseID LIKE 1000"
cursor = conn.cursor()
cursor.execute(query)

results = cursor.fetchall()
if results[0][0] == "Required":
    print("y")
for i in range(len(results[0])):
    print(results[i])
    
conn.close()

y
('Required',)

In [12]:
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
# roomid = "104"
# query = """SELECT capacity FROM classroom WHERE classroomID=""" + roomid
query = """SELECT capacity FROM classroom WHERE classroomID=(
           SELECT classroomID FROM course WHERE courseID=""" + "1000" + ")"
print(query)
cursor = conn.cursor()
cursor.execute(query)
cursor = cursor.fetchall()
print(cursor)

SELECT capacity FROM classroom WHERE classroomID=(
           SELECT classroomID FROM course WHERE courseID=1000)
((2,),)

In [ ]:
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
# roomid = "104"
# query = """SELECT capacity FROM classroom WHERE classroomID=""" + roomid
query = """SELECT capacity FROM classroom WHERE classroomID=(
           SELECT classroomID FROM course WHERE courseID=""" + "1000" + ")"
print(query)
cursor = conn.cursor()
cursor.execute(query)
cursor = cursor.fetchall()
print(cursor)

In [23]:
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")

courseid = "1000"
query = """SELECT name FROM users;"""
print(query)
cursor = conn.cursor()
cursor.execute(query)
cursor = cursor.fetchall()
print(cursor)

SELECT name FROM users;
(('aaa',), ('bbb',))

In [37]:
count = 0
for i in range(len(cursor)):
    ans = []
    print(cursor[i][0])
    query2 = "SELECT courseID FROM " + cursor[i][0] + ";"
    print(query2)
    cursor1 = conn.cursor()
    cursor1.execute(query2)
    arr = cursor1.fetchall()
    print(arr)
    for j in range(len(arr)):
        ans.append(arr[j][0])
    if int(courseid) in ans:
        count+=1
    print(ans)
print(count)

aaa
SELECT courseID FROM aaa;
((1001,), (1003,))
[1001, 1003]
bbb
SELECT courseID FROM bbb;
((1000,), (1001,))
[1000, 1001]
1

In [48]:
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")

query = """SELECT courseID FROM aaa;"""
cursor = conn.cursor()
cursor.execute(query)
cursor = cursor.fetchall()
print(cursor)

((1002,), (1003,))

In [52]:
tot_credits = 0
for i in range(len(cursor)):
    zzz = "SELECT credits FROM course WHERE courseID LIKE " + str(cursor[i][0]) + ";"
    print(query)
    n = conn.cursor()
    n.execute(zzz)
    ans = n.fetchall()
    print(ans)
    tot_credits+=ans[0][0]
print(tot_credits)
xxx = "SELECT credits FROM course WHERE courseID LIKE " + "1000" + ";"
print(xxx)
m = conn.cursor()
m.execute(xxx)
asd = m.fetchall()
print(asd)
tot_credits+=asd[0][0]
print(tot_credits)

SELECT courseID FROM aaa;
((3,),)
SELECT courseID FROM aaa;
((3,),)
6
SELECT credits FROM course WHERE courseID LIKE 1000;
((3,),)
9

In [59]:
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
query1 = "SELECT courseID FROM " + "bbb"
qq = conn.cursor()
qq.execute(query1)
ww = qq.fetchall()
print(ww)

((1000,), (1001,))

In [66]:
course_name = []
for i in range(len(ww)):
    query2 = "SELECT coursename FROM course WHERE courseID LIKE " + str(ww[i][0]) + ";"
    print(query2)
    ee = conn.cursor()
    ee.execute(query2)
    rr = ee.fetchall()
    course_name.append(rr[0][0])
    
print(course_name)

SELECT coursename FROM course WHERE courseID LIKE 1000;
(('SYSTEM PROGRAMMING',),)
SELECT coursename FROM course WHERE courseID LIKE 1001;
(('DATABASE SYSTEMS',),)
['SYSTEM PROGRAMMING', 'DATABASE SYSTEMS']

In [38]:
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
courseid = "1011"
aaaa = conn.cursor()
aaaa.execute("SELECT time FROM course WHERE courseid LIKE " + courseid + ";")
aaans = aaaa.fetchall()
print(aaans[0])
temp = aaans[0][0].split('-')
print(temp)
rrr = "SELECT courseID FROM " + "aaa" + ";"
qq.execute(rrr)
nn = qq.fetchall()
print(nn)

('Mon-08-09-10',)
['Mon', '08', '09', '10']
((1003,), (1004,), (1009,), (1010,))

In [6]:
conn = MySQLdb.connect(host="127.0.0.1",
                       user="hj",
                       passwd="test1234",
                       db="testdb")
qq = conn.cursor()
rrr = "SELECT courseID FROM " + "aaa" + ";"
qq.execute(rrr)
nn = qq.fetchall()
print(nn)

anslist = []
for i in range(len(nn)):
    pp = "SELECT time FROM course WHERE courseid LIKE " + str(nn[i][0]) + ";"
    oo = conn.cursor()
    oo.execute(pp)
    anss = oo.fetchall()
    anslist.append(anss[0][0])
print(anslist)

((1004,), (1009,), (1010,), (1011,), (1012,))
['Tue-01-02-03', 'Mon-02-03-04', 'Wed-11-12-13', 'Mon-08-09-10', 'Wed-02-03-04']

In [40]:
for i in range(len(anslist)):
    tp = anslist[i].split('-')
    if temp[0] == tp[0]:
        print(temp)
        for j in range(1, len(temp)):
            if temp[j] in tp:
                print("error")
                break;

['Mon', '08', '09', '10']